** C语言常用操作
1. lsp-rename 重命名光标下的符号
2. 实现函数原型实现
3. 代码调试
4. 打断点
   代码编
5. 代码运行

   #+begin_quote
 代码补全
快捷键：M-/
函数：company-complete

跳转到定义
快捷键：M-.
函数：lsp-find-definition

返回到上一个位置
快捷键：M-,
函数：xref-pop-marker-stack

查看文档
快捷键：C-c C-d
函数：lsp-describe-thing-at-point

查找引用
快捷键：C-c C-r
函数：lsp-find-references

重命名符号
快捷键：C-c C-r
函数：lsp-rename

显示错误和警告
快捷键：M-g n
函数：flycheck-next-error
快捷键：M-g p
函数：flycheck-previous-error
快捷键：C-c ! l
函数：flycheck-list-errors

悬停提示
快捷键：C-c C-i
函数：lsp-ui-doc-show

代码格式化
快捷键：C-M-\
函数：indent-region
快捷键：M-x lsp-format-buffer
函数：lsp-format-buffer

注释和取消注释
快捷键：M-;
函数：comment-dwim

编译
快捷键：M-x compile
函数：compile

运行程序
快捷键：M-!
函数：shell-command
快捷键：M-x shell-command
函数：shell-command 
   #+end_quote


#+begin_src C
  #include <stdio.h>

  int main() {
  
      printf("hello world");
      printf("hello world2");
      printf("hello world3");

  }
#+end_src

#+RESULTS:
: hello worldhello world2hello world3


